---
kind: property
id: P:Autodesk.Revit.DB.BuildingPadType.ThermalProperties
source: html/3a6a237e-bd05-261a-a6ce-c25a02168f5b.htm
---
# Autodesk.Revit.DB.BuildingPadType.ThermalProperties Property

The calculated and settable thermal properties of the BuildingPadType

## Syntax (C#)
```csharp
public ThermalProperties ThermalProperties { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - the building pad does not have thermal properties.